* STATS
| 447/559 Solved - Easy 134 Medium 229 Hard 84 |
| 101 Locked                                   |

* UNSOLVED
| UNSOLVED                                     |        | reason     |
|----------------------------------------------+--------+------------|
| 148 Sort List                                | Medium | O(1) S     |
| 164 Maximum Gap                              | Hard   | O(n) T/S   |
| 282 Expression Add Operators                 | Hard   | TLE        |
| 312 Burst Balloons                           | Hard   | no idea    |
| 324 Wiggle Sort II                           | Medium | O(n/1) T/S |
| 365 Water and Jug Problem                    | Medium | TLE        |
| 421 Maximum XOR of Two Numbers in an Array   | Medium | O(n) T     |
| 423 Reconstruct Original Digits from English | Medium | what?      |
| 464 Can I Win                                | Medium | wrong      |
| 546 Remove Boxes                             | Hard   | TLE        |
| 587 Erect the Fence                          | Hard   | no idea    |

* OTHERS
| 32 题思路不如 stack 方法 fast, elegant |
| 41 题没想到桶排序类似方法              |
| 460 is not O(1), only beats 1.77%      |
|----------------------------------------|
| Single Number                          |
|----------------------------------------|
| 套路 327, 363, 523, 525                |

* LOCKED
|  LOCKED |     |
|---------+-----|
| 156-159 |   4 |
|     161 |   1 |
|     163 |   1 |
|     170 |   1 |
|     186 |   1 |
| 243-256 |  14 |
|     259 |   1 |
|     261 |   1 |
| 265-267 |   3 |
| 269-272 |   4 |
| 276-277 |   2 |
| 280-281 |   2 |
| 285-286 |   2 |
|     288 |   1 |
|     291 |   1 |
| 293-294 |   2 |
|     296 |   1 |
|     298 |   1 |
|     302 |   1 |
|     305 |   1 |
|     308 |   1 |
|     311 |   1 |
|     314 |   1 |
|     317 |   1 |
|     320 |   1 |
|     323 |   1 |
|     325 |   1 |
|     333 |   1 |
| 339-340 |   2 |
|     346 |   1 |
|     348 |   1 |
|     351 |   1 |
|     353 |   1 |
|     356 |   1 |
| 358-362 |   5 |
|     364 |   1 |
|     366 |   1 |
| 369-370 |   2 |
|     379 |   1 |
|     408 |   1 |
|     411 |   1 |
|     418 |   1 |
|     422 |   1 |
|     425 |   1 |
|     439 |   1 |
|     444 |   1 |
|     465 |   1 |
|     469 |   1 |
|     471 |   1 |
|     484 |   1 |
|     487 |   1 |
|     490 |   1 |
|     499 |   1 |
|     505 |   1 |
|     527 |   1 |
|     531 |   1 |
|     533 |   1 |
|     536 |   1 |
| 544-545 |   2 |
| 548-549 |   2 |
|     555 |   1 |
|     562 |   1 |
|     568 |   1 |
|     573 |   1 |
|     582 |   1 |
|     588 |   1 |
|     604 |   1 |
|     616 |   1 |
|---------+-----|
|     101 | 101 |
#+TBLFM: @$2=vsum(@2$2..@-1$2)
